mcSimoffa/nRF51_BLE_nucleometer/Application/main.c
/**
 * Copyright (c) 2014 - 2017, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update
 * for such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be
 * reverse engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY
 * EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
 * ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "app_error.h"
#include "app_timer.h"
#include "ble.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "ble_gap.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "boards.h"
#include "fds.h"
#include "fstorage.h"
#include "nordic_common.h"
#include "nrf.h"
#include "peer_manager.h"
#include "softdevice_handler.h"

#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_state.h"
#include "ble_dis.h"
#include "ble_bas.h"
#include "ble_hci.h"
#include "bsp.h"
#include "bsp_btn_ble.h"
#include "nrf_gpio.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "sensorsim.h"

#define NRF_LOG_MODULE_NAME "MAIN"

// Buttons functionality here: components\libraries\bsp\bsp_btn_ble.c

#define IS_SRVC_CHANGED_CHARACT_PRESENT 1 /**< Include or not the service_changed characteristic. if not enabled, the server's database cannot be changed for the lifetime of the device*/

#if (NRF_SD_BLE_API_VERSION == 3)
#define NRF_BLE_MAX_MTU_SIZE                                                 \
  GATT_MTU_SIZE_DEFAULT /**< MTU size used in the softdevice enabling and to \
                           reply to a BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST     \
                           event. */
#endif

#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2 // Reply when unsupported features are requested.

#define CENTRAL_LINK_COUNT              0                     // Number of central links used by the application. When changing this number remember to adjust the RAM settings
#define PERIPHERAL_LINK_COUNT           1                     // Number of peripheral links used by the application. When changing this number remember to adjust the RAM settings

#define DEVICE_NAME                     "Nordic_Template"     // Name of device. Will be included in the advertising data.
#define MANUFACTURER_NAME               "NordicSemiconductor" // Manufacturer. Will be passed to Device Information Service. 
#define MODEL_NUM                       "nRF Nucleo"          // Model number. Will be passed to Device Information  Service.
#define MANUFACTURER_ID                 0x1122334455          // Manufacturer ID, part of System ID. Will be passed to Device Information Service.
#define ORG_UNIQUE_ID                   0x667788
#define APP_ADV_INTERVAL                300                   // The advertising interval (in units of 0.625 ms. This value corresponds to 187.5 ms).
#define APP_ADV_TIMEOUT_IN_SECONDS      180                   // The advertising timeout in units of seconds.
                                        
#define APP_TIMER_PRESCALER             0                     // Value of the RTC1 PRESCALER register.
#define APP_TIMER_OP_QUEUE_SIZE         4                     // Size of timer operation queues.
#define SECURITY_REQUEST_DELAY          APP_TIMER_TICKS(400, APP_TIMER_PRESCALER)  // Delay after connection until Security Request is sent, if necessary (ticks)
                                        
#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(100, UNIT_1_25_MS)  // Minimum acceptable connection interval (0.1 seconds). 
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(200, UNIT_1_25_MS)   // Maximum acceptable connection interval (0.2 second).
#define SLAVE_LATENCY                   0   // Slave latency.
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS) // Connection supervisory timeout (4 seconds).

#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER) // Time from initiating event (connect or  start of notification) to first time  sd_ble_gap_conn_param_update is called (5  seconds). 
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER) // Time between each call to    sd_ble_gap_conn_param_update after the first call (30 seconds). 
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                             //Number of attempts before giving up the connection parameter negotiation. 

#define STATIC_PASSKEY_LEN              6

#define SEC_PARAM_BOND                  1                             // Perform bonding.
#define SEC_PARAM_MITM                  1                             //Man In The Middle protection required.
#define SEC_PARAM_LESC                  0                             // LE Secure Connections not enabled. 
#define SEC_PARAM_KEYPRESS              0                             // Keypress notifications not enabled. 
#define SEC_PARAM_IO_CAPABILITIES       BLE_GAP_IO_CAPS_DISPLAY_ONLY  // even if you don't have display
#define SEC_PARAM_OOB                   0                             // Out Of Band data not available. 
#define SEC_PARAM_MIN_KEY_SIZE          7                             // Minimum encryption key size. 
#define SEC_PARAM_MAX_KEY_SIZE          16                            // Maximum encryption key size. 
#define DEAD_BEEF                       0xDEADBEEF                    // Value used as error code on stack dump, can be used to identify stack location on stack unwind.

