mcSimoffa/nRF51_BLE_nucleometer/Application/main.c
    // Don't send delayed Security Request if security procedure is already in progress.
     err_code = app_timer_stop(m_sec_req_timer_id);
     NRF_LOG_INFO("Security timer stop\r\n");
     APP_ERROR_CHECK(err_code);

    NRF_LOG_INFO("Passkey: %s\r\n", nrf_log_push(passkey));
  } break; // BLE_GAP_EVT_PASSKEY_DISPLAY

  case BLE_EVT_USER_MEM_REQUEST:
    err_code = sd_ble_user_mem_reply(m_conn_handle, NULL);
    APP_ERROR_CHECK(err_code);
    break; // BLE_EVT_USER_MEM_REQUEST

  case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST: 
  {
    ble_gatts_evt_rw_authorize_request_t req;
    ble_gatts_rw_authorize_reply_params_t auth_reply;

    req = p_ble_evt->evt.gatts_evt.params.authorize_request;
    if (req.type != BLE_GATTS_AUTHORIZE_TYPE_INVALID) 
    {
      if ((req.request.write.op == BLE_GATTS_OP_PREP_WRITE_REQ) ||
          (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_NOW) ||
          (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL)) 
      {
        if (req.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE) 
        {
          auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
        } 
        else 
        {
          auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
        }
        auth_reply.params.write.gatt_status = APP_FEATURE_NOT_SUPPORTED;
        err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle, &auth_reply);
        APP_ERROR_CHECK(err_code);
      }
    }
  } break; // BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST

#if (NRF_SD_BLE_API_VERSION == 3)
  case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
    err_code = sd_ble_gatts_exchange_mtu_reply(p_ble_evt->evt.gatts_evt.conn_handle, NRF_BLE_MAX_MTU_SIZE);
    APP_ERROR_CHECK(err_code);
    break; // BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST
#endif

  default:
    // No implementation needed.
    break;
  }
}

/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated when button is pressed.
 ******************************************************************* */
static void bsp_event_handler(bsp_event_t event) 
{
  uint32_t err_code;

  switch (event) 
  {
  case BSP_EVENT_SLEEP:
    NRF_LOG_INFO("Sleeping by button...\r\n");
    sleep_mode_enter();
    break; // BSP_EVENT_SLEEP

  case BSP_EVENT_DISCONNECT:
    NRF_LOG_INFO("Disconnecting by button..\r\n");
    err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    if (err_code != NRF_ERROR_INVALID_STATE)
      APP_ERROR_CHECK(err_code);
    break; // BSP_EVENT_DISCONNECT

  case BSP_EVENT_WHITELIST_OFF:
    if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
    {
      err_code = ble_advertising_restart_without_whitelist();
      if (err_code != NRF_ERROR_INVALID_STATE)
        APP_ERROR_CHECK(err_code);
    }
    break; // BSP_EVENT_KEY_0

  default:
    break;
  }
}

//----------------------------------------------------------------------------------
/**@brief Function for dispatching a BLE stack event to all modules with a BLE
 * stack event handler.
 *
 * @details This function is called from the BLE Stack event interrupt handler
 * after a BLE stack event has been received.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 *********************************************************************************** */
static void ble_evt_dispatch(ble_evt_t *p_ble_evt) 
{
  ble_bas_on_ble_evt(&m_bas, p_ble_evt);
  ble_conn_params_on_ble_evt(p_ble_evt);
  /** The Connection state module has to be fed BLE events in order to function
   * correctly Remember to call ble_conn_state_on_ble_evt before calling any
   * ble_conns_state_* functions. */
  ble_conn_state_on_ble_evt(p_ble_evt);
  pm_on_ble_evt(p_ble_evt);

  bsp_btn_ble_on_ble_evt(p_ble_evt);
  on_ble_evt(p_ble_evt);
  ble_advertising_on_ble_evt(p_ble_evt);
  /*YOUR_JOB add calls to _on_ble_evt functions from each service your
application is using ble_xxs_on_ble_evt(&m_xxs, p_ble_evt);
ble_yys_on_ble_evt(&m_yys, p_ble_evt);
*/
}

//-------------------------------------------------------------------------
/**@brief Function for dispatching a system event to interested modules.
 *
 * @details This function is called from the System event interrupt handler
 * after a system event has been received.
 *
 * @param[in] sys_evt  System stack event.
 ************************************************************************ */
static void sys_evt_dispatch(uint32_t sys_evt) 
{
  // Dispatch the system event to the fstorage module, where it will be
  // dispatched to the Flash Data Storage (FDS) module.
  fs_sys_event_handler(sys_evt);

  // Dispatch to the Advertising module last, since it will check if there are
  // any pending flash operations in fstorage. Let fstorage process system
  // events first, so that it can report correctly to the Advertising module.
  ble_advertising_on_sys_evt(sys_evt);
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 ********************************************************************** */
static void ble_stack_init(void) 
{
  uint32_t err_code;

  nrf_clock_lf_cfg_t clock_lf_cfg = NRF_CLOCK_LFCLKSRC;
  SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL); // Initialize the SoftDevice handler module.

  ble_enable_params_t ble_enable_params;
  err_code = softdevice_enable_get_default_config(CENTRAL_LINK_COUNT, PERIPHERAL_LINK_COUNT, &ble_enable_params);
  APP_ERROR_CHECK(err_code);

  // Check the ram settings against the used number of links
  CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT, PERIPHERAL_LINK_COUNT);

  // Enable BLE stack.
#if (NRF_SD_BLE_API_VERSION == 3)
  ble_enable_params.gatt_enable_params.att_mtu = NRF_BLE_MAX_MTU_SIZE;
#endif
  err_code = softdevice_enable(&ble_enable_params);
  APP_ERROR_CHECK(err_code);

  // Register with the SoftDevice handler module for BLE events.
  err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
  APP_ERROR_CHECK(err_code);

  // Register with the SoftDevice handler module for BLE events.
  err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for the Peer Manager initialization.
 *
 * @param[in] erase_bonds  Indicates whether bonding information should be
 * cleared from persistent storage during initialization of the Peer Manager.
 ************************************************************************* */
static void peer_manager_init(bool erase_bonds) 
{
  ble_gap_sec_params_t sec_param;
  ret_code_t err_code;

  err_code = pm_init();
  APP_ERROR_CHECK(err_code);
  if (erase_bonds) 
  {
    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
  }

  memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));
  // Security parameters to be used for all security procedures.
  sec_param.bond = SEC_PARAM_BOND;
  sec_param.mitm = SEC_PARAM_MITM;
  sec_param.lesc = SEC_PARAM_LESC;
  sec_param.keypress = SEC_PARAM_KEYPRESS;
  sec_param.io_caps = SEC_PARAM_IO_CAPABILITIES;
  sec_param.oob = SEC_PARAM_OOB;
  sec_param.min_key_size = SEC_PARAM_MIN_KEY_SIZE;
  sec_param.max_key_size = SEC_PARAM_MAX_KEY_SIZE;
  sec_param.kdist_own.enc = 1;
  sec_param.kdist_own.id = 1;
  sec_param.kdist_peer.enc = 1;
  sec_param.kdist_peer.id = 1;

  err_code = pm_sec_params_set(&sec_param);
  APP_ERROR_CHECK(err_code);

  err_code = pm_register(pm_evt_handler);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the Advertising functionality.
**************************************************************** */
static void advertising_init(void) 
{
  uint32_t err_code;
  ble_advdata_t advdata;
  ble_adv_modes_config_t options;

