mcSimoffa/nRF51_BLE_nucleometer/Application/main.c
  // Build advertising data struct to pass into @ref ble_advertising_init.
  memset(&advdata, 0, sizeof(advdata));

  advdata.name_type = BLE_ADVDATA_FULL_NAME;
  advdata.include_appearance = true;
  advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
  advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
  advdata.uuids_complete.p_uuids = m_adv_uuids;

  memset(&options, 0, sizeof(options));
  options.ble_adv_fast_enabled = true;
  options.ble_adv_fast_interval = APP_ADV_INTERVAL;
  options.ble_adv_fast_timeout = APP_ADV_TIMEOUT_IN_SECONDS;

  err_code = ble_advertising_init(&advdata, NULL, &options, on_adv_evt, NULL);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was
 * pressed to wake the application up.
 */
static void buttons_leds_init(bool *p_erase_bonds) 
{
  bsp_event_t startup_event;

  uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS, APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), bsp_event_handler);

  APP_ERROR_CHECK(err_code);

  err_code = bsp_btn_ble_init(NULL, &startup_event);
  APP_ERROR_CHECK(err_code);

  *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}

/**@brief Function for the Power manager.
 ******************************************  */
static void power_manage(void) 
{
  uint32_t err_code = sd_app_evt_wait();
  APP_ERROR_CHECK(err_code);
}

/*
Define static passkey  
******************************************* */
void static_passkey_def(void) 
{
  static uint8_t static_passkey[] = "654321";
  ret_code_t err_code;
  ble_opt_t opt;

  memset(&opt, 0x00, sizeof(opt));
  opt.gap_opt.passkey.p_passkey = static_passkey;
  err_code = sd_ble_opt_set(BLE_GAP_OPT_PASSKEY, &opt);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application
 * timers.
 *************************************************************************** */
static void timers_init(void) 
{
  uint32_t err_code;
  // Initialize timer module.
  APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);

  /* Create timers. YOUR_JOB: Create any timers to be used by the application.
  Below is an example of how to create a timer  For every new timer needed, increase the value of the macro  APP_TIMER_MAX_TIMERS by one. */

  // Create Security Request timer.
  err_code = app_timer_create(&m_sec_req_timer_id,  APP_TIMER_MODE_SINGLE_SHOT, sec_req_timeout_handler);
  APP_ERROR_CHECK(err_code);

  // Create timers for battery service.
  err_code = app_timer_create(&m_battery_timer_id,  APP_TIMER_MODE_REPEATED,  battery_level_meas_timeout_handler);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access
 * Profile) parameters of the device including the device name, appearance, and
 * the preferred connection parameters.
 ***************************************************************************** */
static void gap_params_init(void) 
{
  uint32_t err_code;
  ble_gap_conn_params_t gap_conn_params;
  ble_gap_conn_sec_mode_t sec_mode;

  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

  err_code = sd_ble_gap_device_name_set(&sec_mode, (const uint8_t *)DEVICE_NAME, strlen(DEVICE_NAME));
  APP_ERROR_CHECK(err_code);

  err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_ENERGY_SENSOR);
  APP_ERROR_CHECK(err_code);

  memset(&gap_conn_params, 0, sizeof(gap_conn_params));

  gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
  gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
  gap_conn_params.slave_latency = SLAVE_LATENCY;
  gap_conn_params.conn_sup_timeout = CONN_SUP_TIMEOUT;

  err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the YYY Service events.
 * YOUR_JOB implement a service handler function depending on the event the
 service you are using can generate
 *
 * @details This function will be called for all YY Service events which are
 passed to
 *          the application.
 *
 * @param[in]   p_yy_service   YY Service structure.
 * @param[in]   p_evt          Event received from the YY Service.
 *
 *
   static void on_yys_evt(ble_yy_service_t     * p_yy_service,
                       ble_yy_service_evt_t * p_evt)
   {
    switch (p_evt->evt_type)
    {
        case BLE_YY_NAME_EVT_WRITE:
            APPL_LOG("[APPL]: charact written with value %s. \r\n",
 p_evt->params.char_xx.value.p_str); break;

        default:
            // No implementation needed.
            break;
    }
   }*/


/* *****************************************************************
This callback indicate a event write to Client Charackteristic Configuration
****************************************************************** */
void bas_handler (ble_bas_t * p_bas, ble_bas_evt_t * p_evt)
{
  NRF_LOG_INFO("Battery notificationt %d\r\n", p_evt->evt_type);  // 0 - Enable 1 - Disable
}

/**@brief Function for initializing services that will be used by the
 * application.
 */
static void services_init(void) 
{
  uint32_t err_code;
  ble_dis_init_t dis_init;
  ble_bas_init_t   bas_init;
  ble_dis_sys_id_t sys_id;

  // Initialize Device Information Service.
  memset(&dis_init, 0, sizeof(dis_init));

  ble_srv_ascii_to_utf8(&dis_init.manufact_name_str, MANUFACTURER_NAME);
  ble_srv_ascii_to_utf8(&dis_init.model_num_str, MODEL_NUM);

  sys_id.manufacturer_id = MANUFACTURER_ID;
  sys_id.organizationally_unique_id = ORG_UNIQUE_ID;
  dis_init.p_sys_id = &sys_id;

  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&dis_init.dis_attr_md.read_perm);
  BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&dis_init.dis_attr_md.write_perm);

  err_code = ble_dis_init(&dis_init);
  APP_ERROR_CHECK(err_code);

  // Initialize Battery Service.
  memset(&bas_init, 0, sizeof(bas_init));

  // Here the sec level for the Battery Service can be changed/increased.
  BLE_GAP_CONN_SEC_MODE_SET_OPEN      (&bas_init.battery_level_char_attr_md.cccd_write_perm);
  BLE_GAP_CONN_SEC_MODE_SET_OPEN      (&bas_init.battery_level_char_attr_md.read_perm);
  BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS (&bas_init.battery_level_char_attr_md.write_perm);

