mcSimoffa/nRF51_BLE_nucleometer/Application/main.c
  BLE_GAP_CONN_SEC_MODE_SET_OPEN      (&bas_init.battery_level_report_read_perm);

  bas_init.evt_handler          = bas_handler;//NULL;
  bas_init.support_notification = true;
  bas_init.p_report_ref         = NULL;
  bas_init.initial_batt_level   = 100;

  err_code = ble_bas_init(&m_bas, &bas_init);
  APP_ERROR_CHECK(err_code);
}



/**@brief Function for initializing the Connection Parameters module.
******************************************************************** */
static void conn_params_init(void) 
{
  uint32_t err_code;
  ble_conn_params_init_t cp_init;

  memset(&cp_init, 0, sizeof(cp_init));
  cp_init.p_conn_params = NULL;
  cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
  cp_init.next_conn_params_update_delay = NEXT_CONN_PARAMS_UPDATE_DELAY;
  cp_init.max_conn_params_update_count = MAX_CONN_PARAMS_UPDATE_COUNT;
  cp_init.start_on_notify_cccd_handle = BLE_GATT_HANDLE_INVALID;
  cp_init.disconnect_on_fail = false;
  cp_init.evt_handler = on_conn_params_evt;
  cp_init.error_handler = conn_params_error_handler;

  err_code = ble_conn_params_init(&cp_init);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting application timers.
 */
static void application_timers_start(void)
{
    uint32_t err_code;

    // Start application timers.
    err_code = app_timer_start(m_battery_timer_id, BATTERY_LEVEL_MEAS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}


/* *****************************************************************
                                                        main cycle
****************************************************************** */
int main(void) 
{
  uint32_t err_code;
  bool erase_bonds;

  // Initialize.
  err_code = NRF_LOG_INIT(NULL);
  APP_ERROR_CHECK(err_code);

  timers_init();
  buttons_leds_init(&erase_bonds);
  ble_stack_init();
  peer_manager_init(erase_bonds);
  if (erase_bonds == true) 
  {
    NRF_LOG_INFO("Bonds erased!\r\n");
  }
  gap_params_init();
  advertising_init();
  services_init();
  conn_params_init();
  static_passkey_def();
  // Start execution.
  NRF_LOG_INFO("Template started\r\n");
  application_timers_start();
  err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
  APP_ERROR_CHECK(err_code);

  // Enter main loop.
  for (;;) {
    if (NRF_LOG_PROCESS() == false) 
    {
       power_manage();
    }
  }
}
